api/app/controllers/authentication_controller.rb

    def login
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kim@g.com"], ["LIMIT", 1]]