api/app/controllers/ceo_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "Manager"]]
---
    def dashboard
        managers = User.where(role: "Manager")