api/app/controllers/ceo_controller.rb

    def all_employees
        if current_user.role!= 'CEO'
            render json: { error: 'Only the CEO can access this.' }, status: :unauthorized
            return
          end
        managers = User.where(role: "Manager")
        employees = User.where(role: "Employee")
---
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "Manager"]]

    def single_employee
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def employees_by_manager
        manager = User.find(params[:id])
        employees = manager.employees
        render json: { manager: manager.firstname, employees: employees}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."manager_id" = ?  [["manager_id", 3]]

   def drinks_by_manager
    if current_user.role!= 'CEO'
        render json: { error: 'Only the CEO can access this.' }, status: :unauthorized
        return
      end
    manager = User.find(params[:id])
    drinks = manager.drinks
    render json: { manager: manager.firstname, drinks: drinks}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "drinks".* FROM "drinks" WHERE "drinks"."manager_id" = ?  [["manager_id", "6"]]