api/app/controllers/drinks_controller.rb

    def drinks_added_by_manager
      # Ensure the current user is an employee
      if current_user&.employee?
        # Find the manager who created the current employee
        manager = current_user.manager

        if manager
          # Find drinks added by the manager
          drinks = Drink.where(manager_id: manager.id)
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."manager_id" = ?  [["manager_id", 6]]

    def drinks_by_manager
      manager_id = params[:manager_id]
      drinks = Drink.where(manager_id: manager_id)
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."manager_id" = ?  [["manager_id", 6]]