api/app/controllers/drinks_controller.rb

INSERT INTO "drinks" ("name", "brand", "capacity", "price", "manager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
 def create_drink
  if current_user&.manager?
    drink = Drink.new(drink_params)

    # Set the manager_id to the ID of the logged-in Manager
    drink.manager_id = current_user.id if current_user&.manager?

    puts "Drink manager_id: #{drink.manager_id}" # Add this line to check the value of drink.manager_id

    if drink.save

SELECT "drinks".* FROM "drinks"
---
  def all_drinks
    drinks = Drink.all

SELECT "drinks".* FROM "drinks" WHERE "drinks"."manager_id" = ?  [["manager_id", "6"]]
---
  def drinks_by_manager
    manager_id = params[:manager_id]
    drinks = Drink.where(manager_id: manager_id)

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "drinks" SET "name" = ?, "brand" = ?, "capacity" = ?, "price" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["name", "red Label"], ["brand", "whisky"], ["capacity", "1000 ml"], ["price", "1850"], ["updated_at", "2023-09-20 13:51:24.093346"], ["id", 4]]
---
def update_drink
  drink = Drink.find(params[:id])

  if drink.manager_id == current_user.id
    if drink.update(drink_params)

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 1]]
---
  def destroy_drink
    drink = Drink.find(params[:id])

    if drink.manager_id == current_user.id
      drink.destroy