api/app/controllers/manager_controller.rb

    def all_employees
        if current_user.role!= 'Manager'
          render json: { error: 'Only the MANAGERS can access this.' }, status: :unauthorized
          return
        end

        manager_id = params[:id]
        manager = User.find_by(id: manager_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def employee
        if current_user.role!= 'Manager'
          render json: { error: 'Only the MANAGERS can access this.' }, status: :unauthorized
          return
        end

        manager_id = params[:id]
        manager = User.find_by(id: manager_id)
        if manager.nil?
          render json: { error: 'Manager not found' }, status: :not_found
          return
        end

        employee_id = params[:employee_id]
        employee = User.find_by(id: employee_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]