api/app/controllers/sales_controller.rb

INSERT INTO "sales" ("employee_id", "drink_id", "price", "quantity", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["employee_id", 8], ["drink_id", 3], ["price", "850"], ["quantity", 2], ["total_price", nil], ["created_at", "2023-09-21 12:53:05.780532"], ["updated_at", "2023-09-21 12:53:05.780532"]]
---
    def create
      sale = Sale.new(sale_params)
      sale.employee_id = current_user.id

      if sale.save

SELECT "sales".* FROM "sales"
---
      def index
        sales = Sale.all

SELECT "sales".* FROM "sales" WHERE "sales"."employee_id" = ?  [["employee_id", 9]]
---
      def employee_sales
        sales = Sale.where(employee_id: current_user.id)

SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      def sale_params
        drink = Drink.find(params[:sale][:drink_id])