api/app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "role", "email", "password_digest", "reset_password_token", "reset_password_token_expires_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_ceo
    user = User.new(user_params)
    user.role = 'CEO'
    if user.save

INSERT INTO "users" ("firstname", "lastname", "role", "email", "password_digest", "reset_password_token", "reset_password_token_expires_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_manager
    if current_user.role!= 'CEO'
      render json: { error: 'Only the CEO can create managers.' }, status: :unauthorized
      return
    end

    user = User.new(user_params)
    user.role = 'Manager'

  # Set the manager's ceo_id to the ID of the logged-in CEO
  user.ceo_id = @current_user.id if @current_user&.ceo?

    if user.save

INSERT INTO "users" ("firstname", "lastname", "role", "email", "password_digest", "reset_password_token", "reset_password_token_expires_at", "created_at", "updated_at", "manager_id", "ceo_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_employee
    if current_user.role!= 'Manager'
      render json: { error: 'Only the CEO can create managers.' }, status: :unauthorized
      return
    end
    user = User.new(user_params)
    user.role = 'Employee'

  # Set the manager's ceo_id to the ID of the logged-in CEO
  user.manager_id = @current_user.id if @current_user&.manager?

    if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]
---
  def destroy
    user = User.find(params[:id])
    if current_user.role == 'CEO' && user.role == 'Manager'
      if user.destroy
        render json: { message: 'Manager deleted successfully' }
      else
        render json: { error: 'Failed to delete Manager' }, status: :unprocessable_entity
      end
    elsif current_user.role == 'Manager' && user.role == 'Employee'
      if user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "firstname" = ?, "lastname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["firstname", "Manager"], ["lastname", "Kimutai"], ["updated_at", "2023-09-20 11:51:23.134417"], ["id", 2]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kim@g.com"], ["LIMIT", 1]]
UPDATE "users" SET "reset_password_token" = ?, "reset_password_token_expires_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["reset_password_token", "[FILTERED]"], ["reset_password_token_expires_at", "[FILTERED]"], ["updated_at", "2023-09-16 11:30:53.921273"], ["id", 1]]
---
  def reset_password
    user = User.find_by(email: params[:email])
    if user
      user.generate_reset_password_token
      if user.save

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "reset_password_token" = ?, "reset_password_token_expires_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["reset_password_token", "[FILTERED]"], ["reset_password_token_expires_at", "[FILTERED]"], ["updated_at", "2023-09-16 11:32:30.738578"], ["id", 1]]
---
  def update_password
    user = User.find_by(reset_password_token: params[:reset_password_token])

    if user && user.reset_password_token_valid?
      if user.update(password_params)