api/app/controllers/users_controller.rb

    def create
      user = User.new(user_params)
      if user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "reset_password_token", "reset_password_token_expires_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def reset_password
      user = User.find_by(email: params[:email])
      if user
        user.generate_reset_password_token
        user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kim@g.com"], ["LIMIT", 1]]
UPDATE "users" SET "reset_password_token" = ?, "reset_password_token_expires_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["reset_password_token", "[FILTERED]"], ["reset_password_token_expires_at", "[FILTERED]"], ["updated_at", "2023-09-16 11:30:53.921273"], ["id", 1]]

    def update_password
      user = User.find_by(reset_password_token: params[:reset_password_token])
      if user && user.reset_password_token_valid?
        user.update(password: params[:password], reset_password_token: nil, reset_password_token_expires_at: nil)
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "reset_password_token" = ?, "reset_password_token_expires_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["reset_password_token", "[FILTERED]"], ["reset_password_token_expires_at", "[FILTERED]"], ["updated_at", "2023-09-16 11:32:30.738578"], ["id", 1]]