api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "emp1@truth.com"], ["LIMIT", 1]]
---
  def reset_password
    user = User.find_by(email: params[:email])

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def update_password
    user = User.find_by(reset_password_token: params[:reset_password_token])